"""
ケーキの切り分け２ (Cake 2)
方針
・dp[l][r]:=残り[l,r]となった状態で、JOIくんの取り分合計が最大となる場合の値

更新
(i)  JOIくんのターンの時
dp[][] = 
(ii) IOIくんのターンの時(最大をとる)
dp[][] = 

JOIくんの取り分合計が最大になるようにする

dp表
----------------
     j=0 j=1 j=2 j=3 j=4
i=0   0   0   0   0   0 
i=1   0   0   0   0   0 
i=2   0   0   0   0   0 
i=3   0   0   0   0   0 
i=4   0   0   0   0   0 
----------------
5
---
 2 id=0
 8 id=1
 1 id=2
10 id=3
 9 id=4
---
18

JOI: 8 + 9 + 1 
IOI: 2 + 10


15
182243672
10074562
977552215
122668426
685444213
3784162
463324752
560071245
134465220
21447865
654556327
183481051
20041805
405079805
564327789
--
3600242976
"""